# Transform of ETL (Extract-Transform-Load) pipeline
[Link to GitHub](https://github.com/stanislavlia/datascience_club_projects/blob/main/project1_etl_pipeline/transform.py)

In [37]:
!pip3 install pandas

Requirement already satisfied: pandas in /Users/yuran653/42_ds_club/.venv/lib/python3.10/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.22.4 in /Users/yuran653/42_ds_club/.venv/lib/python3.10/site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/yuran653/42_ds_club/.venv/lib/python3.10/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/yuran653/42_ds_club/.venv/lib/python3.10/site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in /Users/yuran653/42_ds_club/.venv/lib/python3.10/site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in /Users/yuran653/42_ds_club/.venv/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [38]:
# Import Pandas and json modules
import pandas as pd
import json

In [39]:
# Define the file path for the batch of users (extracted in a previous phase) in JSON format
# Note: Update the path as needed to point to the correct location of your batch file
# BATCH_PATH = '/content/drive/MyDrive/42_DS_Club/01_ETL_pipeline/batch1000users.json'
BATCH_PATH = 'batch1000users.json'

In [40]:
# Open the JSON file at the specified BATCH_PATH in read mode
with open(BATCH_PATH, "r") as file:
    # Load the JSON content from the file into 'batch_json' dictionary
    batch_json = json.load(file)

In [41]:
from random import randint

# Select a random user from the 'users' list in 'batch_json'
batch_json['users'][randint(0, len(batch_json['users']) - 1)]

{'id': ' None',
 'firstname': 'Zoe',
 'lastname': 'Hughes',
 'location_city': 'Rotorua',
 'location_country': 'New Zealand',
 'location_state': 'West Coast',
 'location_latitude': '51.0772',
 'location_longitude': '20.2298',
 'location_postcode': 99745,
 'location_street_info': 'Dickens Street, 6673',
 'email': 'zoe.hughes@example.com',
 'gender': 'female',
 'login_uuid': 'f43fa3bf-f5d5-4fc7-b71e-e449a6e14d49',
 'login_username': 'tinywolf377',
 'login_password': 'bayern',
 'phone': '(390)-282-6078',
 'cell': '(473)-269-9959',
 'date_of_birth': '1961-11-14T15:28:39.716Z',
 'age': 62,
 'date_of_registration': '2014-02-17T19:00:29.633Z',
 'photo_link': 'https://randomuser.me/api/portraits/women/64.jpg',
 'extract_time': '2024-11-05 19:46:14.892076'}

**[Pandas](https://pandas.pydata.org/)**

Pandas is a powerful, open-source data analysis and manipulation library for Python. It’s widely used in data science, finance, statistics, and any field where data analysis is essential. With Pandas, you can effortlessly work with large datasets, transforming raw data into clean, organized formats.

The primary data structure in Padas is **[DataFrame](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html)**. It is two-dimensional, size-mutable, potentially heterogeneous tabular data.

For an easy introduction to Pandas, it’s **highly** recommended to complete a **[Pandas course on Kaggle](https://www.kaggle.com/learn/pandas)**

In [42]:
# Create a DataFrame from the 'users' data in the dictionary 'batch_json'
df = pd.DataFrame(batch_json["users"])

In [43]:
# Display the first 3 rows of the DataFrame
df.head(3)

,id,firstname,lastname,location_city,location_country,location_state,location_latitude,location_longitude,location_postcode,location_street_info,...,login_uuid,login_username,login_password,phone,cell,date_of_birth,age,date_of_registration,photo_link,extract_time
0,UIDAI 767726925886,Pramitha,Almeida,Katni,India,Sikkim,9.4609,78.4463,22200,"Rasta Peth, 9600",...,80d9fb7d-2c68-4a0a-8a76-8dfc22f21faf,happylion849,idontknow,7911969693,9779964598,1997-12-14T17:29:08.037Z,26,2018-05-24T06:52:04.724Z,https://randomuser.me/api/portraits/women/12.jpg,2024-11-05 19:36:33.766316
1,CPR 060898-9765,Marcus,Madsen,Samsø,Denmark,Syddanmark,-40.0968,-158.0918,35306,"Præstevej, 400",...,87e0abf4-c2ed-4ff9-9432-2f9318f8e1cf,bluecat257,cyber,15959079,58165315,1998-08-06T10:11:20.306Z,26,2014-09-14T03:14:47.150Z,https://randomuser.me/api/portraits/men/22.jpg,2024-11-05 19:36:34.178473
2,SIN 172905911,Tristan,Chan,Richmond,Canada,Nova Scotia,-72.5582,-79.3374,F9Q 6V4,"Bay Ave, 4544",...,e2e73b7e-d430-4bfb-a28c-374c60fae58f,orangerabbit314,beatles,K09 Q93-5986,K17 N11-3266,1970-12-23T17:47:13.557Z,53,2007-08-14T08:56:12.806Z,https://randomuser.me/api/portraits/men/78.jpg,2024-11-05 19:36:34.724902

In [44]:
# Display a random sample of 5 rows from the DataFrame
df.sample(5)

,id,firstname,lastname,location_city,location_country,location_state,location_latitude,location_longitude,location_postcode,location_street_info,...,login_uuid,login_username,login_password,phone,cell,date_of_birth,age,date_of_registration,photo_link,extract_time
526,CPF 834.416.453-43,Amália,Moura,Governador Valadares,Brazil,Mato Grosso,-80.9963,79.4486,46013,"Rua Principal, 6432",...,0a80a856-66fe-481e-9a82-5e973549d562,blackgoose932,ladder,(32) 6834-1419,(43) 9488-7554,1978-08-22T04:41:30.647Z,46,2012-04-20T03:02:51.202Z,https://randomuser.me/api/portraits/women/22.jpg,2024-11-05 19:42:06.190961
335,SID 029934676,Mita,Stojanović,Bogatić,Serbia,North Banat,57.8566,-60.7184,89519,"Dušana Damjanovića, 8151",...,8c4d326e-30a7-4b90-8124-36d8a31e5f73,bigelephant301,applepie,022-0939-423,061-1445-589,1969-06-23T07:38:37.951Z,55,2019-07-22T01:09:18.724Z,https://randomuser.me/api/portraits/men/51.jpg,2024-11-05 19:39:59.605502
119,UIDAI 546234630920,Divyesh,Shenoy,Bijapur,India,Assam,11.1029,-81.9331,72703,"Kasba Peth, 5748",...,5d59621b-a019-4777-ac09-f5c851b8341c,angrylion981,sherman,8075220725,8374265261,1963-09-26T17:28:24.346Z,61,2018-06-23T11:02:14.754Z,https://randomuser.me/api/portraits/men/52.jpg,2024-11-05 19:37:41.547663
768,TFN 757772714,Nathaniel,Montgomery,Port Macquarie,Australia,Western Australia,-81.7499,-57.4535,7352,"Central St, 3728",...,b9951ae1-50ae-44df-9507-5d55145ab9cf,angrykoala408,faster,00-2366-6894,0468-996-835,1992-06-07T04:03:47.533Z,32,2009-08-21T01:12:55.546Z,https://randomuser.me/api/portraits/men/34.jpg,2024-11-05 19:44:30.131099
112,SSN 655-05-9197,Brooklyn,Green,West Covina,United States,Maryland,88.2853,93.0050,10792,"Valley View Ln, 7337",...,25b6bdf6-0edb-4e18-a0ee-0f3afacb15a5,tinybear974,uuuuuuuu,(777) 236-3448,(348) 272-9910,1956-05-29T23:47:09.197Z,68,2015-05-10T23:27:31.068Z,https://randomuser.me/api/portraits/women/95.jpg,2024-11-05 19:37:37.801794

In [45]:
# Display the last 3 rows of the DataFrame
df.tail(3)

,id,firstname,lastname,location_city,location_country,location_state,location_latitude,location_longitude,location_postcode,location_street_info,...,login_uuid,login_username,login_password,phone,cell,date_of_birth,age,date_of_registration,photo_link,extract_time
997,AVS 756.4831.6954.36,Andrée,Duval,Wigoltingen,Switzerland,Valais,-61.0750,85.0447,5011,"Rue Abel-Hovelacque, 1202",...,043815fd-f0ac-44cd-8980-0d65c1795a99,beautifulbird832,kristine,077 365 68 44,078 881 31 38,1967-04-07T04:27:22.374Z,57,2009-09-03T16:51:13.978Z,https://randomuser.me/api/portraits/women/73.jpg,2024-11-05 19:46:55.487354
998,SID 854371445,Slaviša,Karadžić,Medveđa,Serbia,Toplica,57.0486,-165.3553,27930,"Zlate Petković , 1624",...,b482f7e3-69d7-4d15-b72c-e48c7070f7d2,blackrabbit923,invest,020-4094-814,065-9633-612,1959-04-07T06:49:29.902Z,65,2012-12-22T04:52:20.287Z,https://randomuser.me/api/portraits/men/79.jpg,2024-11-05 19:46:56.149614
999,NINO SG 14 83 84 E,Vicky,Jones,Chester,United Kingdom,Surrey,-10.0509,23.5341,I2 4JQ,"The Drive, 6992",...,f7b1bd3d-8997-4204-a0a6-e9ac83d4e3b8,happytiger628,odessa,017687 53378,07252 462420,1980-11-05T05:27:34.005Z,44,2017-12-21T15:07:49.241Z,https://randomuser.me/api/portraits/women/50.jpg,2024-11-05 19:46:56.764478

In [46]:
# Display a concise summary of the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 22 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    1000 non-null   object
 1   firstname             1000 non-null   object
 2   lastname              1000 non-null   object
 3   location_city         1000 non-null   object
 4   location_country      1000 non-null   object
 5   location_state        1000 non-null   object
 6   location_latitude     1000 non-null   object
 7   location_longitude    1000 non-null   object
 8   location_postcode     1000 non-null   object
 9   location_street_info  1000 non-null   object
 10  email                 1000 non-null   object
 11  gender                1000 non-null   object
 12  login_uuid            1000 non-null   object
 13  login_username        1000 non-null   object
 14  login_password        1000 non-null   object
 15  phone                 1000 non-null   object
 16  cell                  1000 non-null   object
 17  date_of_birth         1000 non-null   object
 18  age                   1000 non-null   int64
 19  date_of_registration  1000 non-null   object
 20  photo_link            1000 non-null   object
 21  extract_time          1000 non-null   object
dtypes: int64(1), object(21)
memory usage: 172.0+ KB

In [47]:
# Select the 'location_latitude' and 'location_longitude' columns from the DataFrame
df[['location_latitude', 'location_longitude']]

    location_latitude location_longitude
0              9.4609            78.4463
1            -40.0968          -158.0918
2            -72.5582           -79.3374
3             35.7641           -64.9800
4            -43.0572          -177.5865
..                ...                ...
995          -58.9993          -167.2423
996           65.5227           -15.4636
997          -61.0750            85.0447
998           57.0486          -165.3553
999          -10.0509            23.5341

[1000 rows x 2 columns]

In [48]:
# Select the 'location_latitude' and 'location_longitude' columns from the DataFrame using the .get() method
df.get(['location_latitude', 'location_longitude'])

    location_latitude location_longitude
0              9.4609            78.4463
1            -40.0968          -158.0918
2            -72.5582           -79.3374
3             35.7641           -64.9800
4            -43.0572          -177.5865
..                ...                ...
995          -58.9993          -167.2423
996           65.5227           -15.4636
997          -61.0750            85.0447
998           57.0486          -165.3553
999          -10.0509            23.5341

[1000 rows x 2 columns]

In [49]:
# Select the 'location_latitude' and 'location_longitude' columns from the DataFrame using the .loc() method
df.loc[:, ['location_latitude', 'location_longitude']]

    location_latitude location_longitude
0              9.4609            78.4463
1            -40.0968          -158.0918
2            -72.5582           -79.3374
3             35.7641           -64.9800
4            -43.0572          -177.5865
..                ...                ...
995          -58.9993          -167.2423
996           65.5227           -15.4636
997          -61.0750            85.0447
998           57.0486          -165.3553
999          -10.0509            23.5341

[1000 rows x 2 columns]

In [50]:
# Convert the 'location_longitude' and 'location_latitude' columns to float type
df['location_longitude'] = df['location_longitude'].astype(float)
df['location_latitude'] = df['location_latitude'].astype(float)

In [51]:
# Get the data types of the 'location_latitude' and 'location_longitude' columns
df.get(['location_latitude', 'location_longitude']).dtypes

location_latitude     float64
location_longitude    float64
dtype: object

In [52]:
# Retrieve the column names of the DataFrame 'df'
df.columns

Index(['id', 'firstname', 'lastname', 'location_city', 'location_country',
       'location_state', 'location_latitude', 'location_longitude',
       'location_postcode', 'location_street_info', 'email', 'gender',
       'login_uuid', 'login_username', 'login_password', 'phone', 'cell',
       'date_of_birth', 'age', 'date_of_registration', 'photo_link',
       'extract_time'],
      dtype='object')

Python has a wide range of modules for most typical tasks. While using external modules carries some risk, it is often more productive than "reinventing the wheel". In our dataset, we have a column called `'location_country'`, which currently contains strings that are not very useful. But, if we convert these strings into a standardized format (such as [ISO](https://www.iso.org/)), we can extract some valuable information.

Regarding `'location_country'` column: we can convert the country names to [ISO2](https://www.iban.com/country-codes/) format using the [country-converter](https://pypi.org/project/country-converter/) module.

In [53]:
# Install the 'country_converter' package
!pip3 install country_converter

Requirement already satisfied: country_converter in /Users/yuran653/42_ds_club/.venv/lib/python3.10/site-packages (1.2)
Requirement already satisfied: pandas>=1.0 in /Users/yuran653/42_ds_club/.venv/lib/python3.10/site-packages (from country_converter) (2.2.3)
Requirement already satisfied: numpy>=1.22.4 in /Users/yuran653/42_ds_club/.venv/lib/python3.10/site-packages (from pandas>=1.0->country_converter) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/yuran653/42_ds_club/.venv/lib/python3.10/site-packages (from pandas>=1.0->country_converter) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/yuran653/42_ds_club/.venv/lib/python3.10/site-packages (from pandas>=1.0->country_converter) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in /Users/yuran653/42_ds_club/.venv/lib/python3.10/site-packages (from pandas>=1.0->country_converter) (2024.2)
Requirement already satisfied: six>=1.5 in /Users/yuran653/42_ds_club/.venv/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas>=1.0->country_converter) (1.16.0)

In [54]:
# Import 'country_converter' module
import country_converter

In [55]:
# Define a function to convert a country name to ISO2 code
def convert_country_code(country_name: str) -> str:
  iso_code = country_converter.convert(country_name, to='ISO2')
  return iso_code

# Apply the convert_country_code function to the 'location_country' column
# and create a new column 'country_iso2' with the ISO2 country codes
df['country_iso2'] = df['location_country'].apply(convert_country_code)

In [56]:
# Count the occurrences of unique combinations of the values (including NaN)
# in the 'location_country' and 'country_iso2' columns
df.get(['location_country', 'country_iso2']).value_counts(dropna=False)

location_country  country_iso2
Serbia            RS              58
Finland           FI              57
Norway            NO              55
Iran              IR              54
Spain             ES              52
New Zealand       NZ              50
Switzerland       CH              49
Netherlands       NL              49
Denmark           DK              49
Canada            CA              48
Australia         AU              47
Brazil            BR              47
Germany           DE              46
India             IN              46
Mexico            MX              46
Ukraine           UA              45
Ireland           IE              43
United States     US              42
United Kingdom    GB              42
Turkey            TR              40
France            FR              35
Name: count, dtype: int64

In [57]:
# Count the number of NaN values in the 'phone' and 'cell' columns
df.get(['phone', 'cell']).isna().sum()

phone    0
cell     0
dtype: int64

In [58]:
# Select the 'phone' and 'cell' columns
df.get(['phone', 'cell'])

              phone            cell
0        7911969693      9779964598
1          15959079        58165315
2      K09 Q93-5986    K17 N11-3266
3     (0732) 928722   (06) 29729945
4          21078902        60853923
..              ...             ...
995   075 029 67 42   077 798 23 04
996  (613)-797-2110  (361)-872-2189
997   077 365 68 44   078 881 31 38
998    020-4094-814    065-9633-612
999    017687 53378    07252 462420

[1000 rows x 2 columns]

The `'phone'` and `'cell'` columns do not contain missing (`NaN`) values, but the phone number formats differ, making the values unclear. A good approach is [to standardize all phone numbers](https://medium.com/@marc.bolle/fetching-and-formatting-phone-numbers-in-python-794ae16ab198) according to the [E.164](https://en.wikipedia.org/wiki/E.164) format using the [phonenumbers module](https://github.com/daviddrysdale/python-phonenumbers/tree/dev) [(documentation available)](https://daviddrysdale.github.io/python-phonenumbers/#-is_valid_number).

In [59]:
!pip3 install phonenumbers

Requirement already satisfied: phonenumbers in /Users/yuran653/42_ds_club/.venv/lib/python3.10/site-packages (8.13.49)

In [60]:
import phonenumbers as ph
from phonenumbers.phonenumberutil import NumberParseException

The relevant methods of the module do not correctly convert US and Canadian numbers that contain letters and do not fully parse all `'()'`, and `'-'` characters. Here is my simple function to handle this:

In [61]:
# Define a function to convert alpha characters to their corresponding digits
def convert_alpha(phone_number : str) -> str:
  # Mapping of alpha characters to their respective digits on a phone keypad
  letters_to_digit = {
      'A': '2', 'B': '2', 'C': '2',
      'D': '3', 'E': '3', 'F': '3',
      'G': '4', 'H': '4', 'I': '4',
      'J': '5', 'K': '5', 'L': '5',
      'M': '6', 'N': '6', 'O': '6',
      'P': '7', 'Q': '7', 'R': '7', 'S': '7',
      'T': '8', 'U': '8', 'V': '8',
      'W': '9', 'X': '9', 'Y': '9', 'Z': '9'
  }

  # Skips any character that is not a number or in the map
  # Convert the character to its corresponding digit if it is in the map
  return ''.join(letters_to_digit.get(c, c) for c in phone_number.upper()
                   if letters_to_digit.get(c, c).isdigit())

In [62]:
# Define a function to normalize a phone number
def normalize_number(number: str, cc_iso2: str) -> str:
  try:
    # Parse the phone number after converting alphabetic characters using the ISO2 code
    number_obj = ph.parse(convert_alpha(number), region=cc_iso2)
  except NumberParseException as e:
    return 'number_not_parsed'
  # Check if the parsed number is valid
    if not ph.is_valid_number(number_obj):
      return 'number_not_valid'
  # Format the valid number to E.164 format
  normalized = ph.format_number(number_obj, ph.PhoneNumberFormat.E164)
  return normalized

By the way, without ISO2 code the `'parse'` method does not work

In [63]:
# Normalize the 'phone' and 'cell' columns for each row
# Store the results in a new columns 'normalized_phone' and 'normalized_cell'
df['normalized_phone'] = df.apply(lambda row: normalize_number(row['phone'], row['country_iso2']), axis=1)
df['normalized_cell'] = df.apply(lambda row: normalize_number(row['cell'], row['country_iso2']), axis=1)

In [64]:
# Count the occurrences of unique value in the 'normalized_phone', including NaN's
df.get(['normalized_phone']).value_counts(dropna=False)

normalized_phone
+989258755705        9
number_not_parsed    3
+918182760085        2
+61655379809         2
+41754146169         2
                    ..
+989252589909        1
+986172218779        1
+989435415309        1
+989960537481        1
+986359799009        1
Name: count, Length: 985, dtype: int64

In [65]:
# Count the occurrences of unique value in the 'normalized_cell', including NaN's
df.get(['normalized_cell']).value_counts(dropna=False)

normalized_cell
+989428064041      9
+917220660005      2
+61461285562       2
+41768995039       2
+353819933462      2
                  ..
+989888908171      1
+989909988924      1
+989926680012      1
+989935840571      1
+12929896504       1
Name: count, Length: 987, dtype: int64

In [66]:
from datetime import datetime

[Python Datetime](https://www.w3schools.com/python/python_datetime.asp)

[pandas.to_datetime](https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html)

In [67]:
# Convert data-related columns to datetime object
df["date_of_registration"] = pd.to_datetime(df["date_of_registration"])
df["date_of_birth"] = pd.to_datetime(df["date_of_birth"])
df["extract_time"] = pd.to_datetime(df["extract_time"])

In [68]:
# Extract the year, month, and day from 'date_of_registration' and create separate columns
df["year_of_registration"] = df["date_of_registration"].dt.year
df["month_of_registration"] = df["date_of_registration"].dt.month
df["day_of_registration"] = df["date_of_registration"].dt.day

In [69]:
# Standardize the 'gender' column by replacing "male" with "M" and "female" with "F"
df["gender"] = df["gender"].replace({"male": "M", "female": "F"})

In [70]:
# Store in new columns the lenght's values of the 'login_password' and 'login_username'
df["password_length"] = df["login_password"].apply(len)
df["login_length"] = df["login_username"].apply(len)

It is strongly reccomended to set time stamp for tracking data modifications:

In [71]:
# Add the current timestamp to the new 'transform_timestamp' column
df["transform_timestamp"] = datetime.now()

Here we stop. But even in this simple and plain dataset, there are plenty of opportunities for verifying and converting data, as well as creating new features that can provide deeper insights.

In [72]:
output_path = 'batch1000users.csv'
df.to_csv(output_path)

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 31 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     1000 non-null   object
 1   firstname              1000 non-null   object
 2   lastname               1000 non-null   object
 3   location_city          1000 non-null   object
 4   location_country       1000 non-null   object
 5   location_state         1000 non-null   object
 6   location_latitude      1000 non-null   float64
 7   location_longitude     1000 non-null   float64
 8   location_postcode      1000 non-null   object
 9   location_street_info   1000 non-null   object
 10  email                  1000 non-null   object
 11  gender                 1000 non-null   object
 12  login_uuid             1000 non-null   object
 13  login_username         1000 non-null   object
 14  login_password         1000 non-null   object
 15  phone                  1000 non-null   object
 16  cell                   1000 non-null   object
 17  date_of_birth          1000 non-null   datetime64[ns, UTC]
 18  age                    1000 non-null   int64
 19  date_of_registration   1000 non-null   datetime64[ns, UTC]
 20  photo_link             1000 non-null   object
 21  extract_time           1000 non-null   datetime64[ns]
 22  country_iso2           1000 non-null   object
 23  normalized_phone       1000 non-null   object
 24  normalized_cell        1000 non-null   object
 25  year_of_registration   1000 non-null   int32
 26  month_of_registration  1000 non-null   int32
 27  day_of_registration    1000 non-null   int32
 28  password_length        1000 non-null   int64
 29  login_length           1000 non-null   int64
 30  transform_timestamp    1000 non-null   datetime64[us]
dtypes: datetime64[ns, UTC](2), datetime64[ns](1), datetime64[us](1), float64(2), int32(3), int64(3), object(19)
memory usage: 230.6+ KB